[{"title":"SCOI2018游记","date":"2018-04-13T03:36:12.000Z","path":"posts/SCOI2018/","text":"省选考完刚好一周了，总感觉还是想流水账式的把省选的一些心情记录下来，在OI的日子是过一天少一天了，希望以后至少还能有一些能够回忆的东西。 Day0算是电子神鸡大学的骗钱集训刚刚结束，上午考了一场模拟赛，考了什么题忘了，神鸡大学可能是为了二次利pian用qian，连题甚至代码都没有发下来，只有成绩，前十几个除了akb以外清一色的cdqz的dalao，还有ak的。我太菜了只有100分（其实我觉得是收错代码了QAQ），所以就当考前爆炸一波玄学攒人品。下午不是很开心不想复习，yz和TGSteven在开黑lol，我太菜了不敢去坑，所以一直在推gal，当时想如果退役了以后就没法这样理性愉悦了所以在最后的时光愉悦一下，晚上10点才开始复习各类算法模板，差不多12点才睡，反正会的都会了，不会的也只能骗分，保证不会敲不出版子就行了。内心很纠结，NOIP考完已经走了很多本来有能力留下的人了，不知道省选之后机房还能剩下几个人，还是说一个不剩。我是真的菜，但就跟yzh批判我的一样，在机房待了这么久了，不想就这么离开，总还想要留下一些什么。 Day1早上起来喝了点咖啡，感觉状态还行，到基础实验楼已经有点晚了，有一点紧张。系统还是一如既往的Win7，不知道什么时候才会有正常的NOILinux，怕电脑卡不是很敢用虚拟机。先敲了一个VIM的配置，然后打完模板，我敲键盘太慢了，打完已经8点10分了，键盘和往年一样，舒适度能接受，但是Enter是_|形的，是真的有毒，两次退格就能按到一次Enter，电脑屏幕有点窄很难受。花了半个小时看题，第一题一眼链分治，第二题二次剩余模板题，第三题是一个奇怪的联通性问题（雾），第一题空间限制64MB瞩目，不知道出题人是什么心态。然后先花一个多小时敲了第一题，链分治思路很简单，但是我敲代码有点慢，加上暴力和对拍大概十点写完，还剩三个小时，再看了一下空间应该没炸，觉得很稳，当时想第一题应该大家都会，第二题会敲二次剩余的应该都会，第三题不太会，如果能A一二题Day1应该就没啥问题了，然后赶紧敲第二题。第二题一个小时写完，编译的时候发现编译了10秒，莫名其妙，打开任务管理器，物理内存95%，看了看旁边跑了两万多组的第一题对拍，秒懂发生了什么，问了一下监考老师，说是重启不会还原，有点心虚的重启了一遍，没什么问题，开始调第二题。样例没过，发现大概是把两个变量搞反了，日常不看题。改完发现大样例跑不过，还以为死循环了，结果居然跑了50秒，瞬间心态爆炸，而且我sb到花了20分钟才发现我的复杂度瓶颈不在树的启发式合并上，而在于跑了1e5次二次剩余居然这么慢，当时完全蒙了，吃了一点零食冷静下来才发现只需要做一次二次剩余，写完拍小数据过完大样例已经12点10分了。最后五十分种想在第三题上面拿点分，花了二十分钟推发现其实就是求一个方程是否有解，先不管某个奇怪的定理，其实稍有常识的人都知道一次方程只要gcd能整除就有解，十分钟敲完三十分暴力，想了想正解大概是个高斯消元之类的吧，反正我不会，会也没时间了，于是randshuffle了一下，卡时间乱搞，大样例能对90%以上，很满足了，反正也没分，就理性愉悦一下，最后检查了一下代码开始发呆，感觉考的还算轻松，题能接受，至少不是2017那种奇葩题了。考完下来才发现原来第一题就是一道SBLCT，我写链分治这么麻烦简直是数据结构学傻了，脑袋被门夹了，结果似乎很多dalao直接上的动态点分被卡空间了。第二题写出来的人好像并不多，第三题大家都说暴力不好写表示不理解，有点心虚是不是我推错了。下午边推gal边等成绩，教练电话打过来说我第二题炸了只有10分，幸好第三题没挂，而且似乎很多人都没推出第三题暴力分的样子，全场只有天下第一wxh大爷上了200，我100 + 10 + 30排第7，但是大家都一百多分根本没有分差，TG和Yonda都一般，yz炸惨了，Day2翻盘很难。相当难受，OI就是这种有时候成绩出来能让人说不出来难受的考试，基本就是还要看Day2考的怎么样了。当时第二题很不服，明明过了对拍过了大样例还tm只有10分，思路也完全不可能有问题，心态巨tm爆炸，想了一下打电话给教练说想申述，教练问了一下似乎科大那边是测了两遍的，而且说我T了，心里一万个MMP，完全不理解，难不成我把暴力交上去了？，但只能接受现实。此处强烈抗议考完不发题不发数据不发代码，今年又没出去年那种并不喜闻乐见的锅，为什么不把题发出来，不公开透明难道不会出现很多不必要的问题吗？颓到了11点理由：调节心态，复习到12点睡。 Day2进考场惊奇的发现回收站没有被还原，第一天的VIMRC和删掉的代码全部在里面，但是习惯性手贱靠惯性就把回收站清空了，但是Day2进考场时间相对Day1比较早，该做的准备工作做完才7点50。看题花了半个小时，得出的结论是我只会第一题，毕竟sb线段树，第二题计算几何网络流sxbk，第三题可持久化了一个我根本不会的东西，然后开始写第一题。第一题半个小时写完跑样例才发现我想错了，又想了一会儿再写了半个小时觉得大概没问题之后对拍出锅了，改完调完刚过去两个小时。最开始做第二题我以为这是一道sb题，写了一个网络流花了一个小时，跑完样例才发现我把题看错了，考场血与泪的惨痛教训。再审了一遍题大概是给了60分部分分，加网络流可以100，我觉得我不太会计算几何，但如果大家都会我就GG了，比如某年SCOI大家都会字符串，60分拿到进队应该就稳了，第二题暴力分思路不太难，但我就是不会写计算几何啊，疯狂敲了一个半小时挂了，心态相当崩，调不出来，才想起去年我也是把计算几何的暴力敲挂了，觉得就这样被送出队很憋屈，心里很乱。最后二十分钟觉得再怎么说也要挣扎一下，10分钟敲了第三题的10分暴力，第三题本来给了40分暴力，我硬是头铁想拿第二题60分，也没时间拿40分。最后10分钟整理完文件脑子里很乱，也不知道自己怎么想的，最后一次省选接连出现看错题和时间安排失误，只能听天由命了。考完出来，我的成绩不稳，而且Day第二题挂了之后也不敢信任对拍了，也不知道第一题会不会炸。TG和Yonda不会第一题，大概是都炸了，yz写了第一题的神奇骗分，对随机数据几乎不会错，本来吐槽这怎么可能有分，但想到去年某道差点把去年还是初三的大爷wj送进队，又无话可说了。。。和mgg吃了饭，然后大家都回去了，心情很复杂，在电子科大图书馆一个人等成绩，图书馆不敢逛B站，强行开了个CF做来转移注意力，想着这会不会是我在OI生涯中做的最后一道题了。TG和Yonda是有实力的，明年还有相当不小的机会，但高一的机会是用一次少一次了，而yz打算今年直接考川大，得回去暴学高考了。以前我还高一的时候也曾以为机会很多，想不到也只能在这里听天由命了。后悔高一省选太年轻不喜欢打暴力，当时打完暴力就进队了，现在也不至于菜成这样，后悔清华冬令营太紧张没有答出那个abcd * 9 = dcba，答出拿到面试分有个无条件一本也不至于被进队左右命运，甚至有点后悔为什么要选择OI，如果能从初一开始就认真搞文化课，至少可以多看一些书，多一和人交流的空间。。。但也无所谓了。在图书馆的等到快该出成绩的时间，教练打电话过来，没接，回了一个短信，心里很乱，不知道是通知我进队的还是买D的，D类买不买很纠结，直接回去高考会不会更好。过了几分钟教练QQ说电子科大那边说我进队了让我过去看成绩，当时脑子一片空白，赶紧骑共享单车以最快速度赶完从图书馆到基础实验楼的200米。粗略扫完成绩单，觉得大概是真的没问题了，松了一口气，但可能还不太放心，和教练直接在实验楼门口统计了一波成绩，rk8，前面还有一个cdqz被学校杀的大爷，被强行拉在实验楼门口和教练拍了一张照，但其他人都没来，可能根本没有心情吧。大概是都结束了吧，突然有点理解杨爷去年的感受了，进省队应该还是高兴的吧，但更多的却只是暂时松了一口气，终于能在这条路上再多走一段时间了，终于不至于留下一个长久的遗憾了，如果我退役了，或许在本校OI的历史上会成为一个笑话吧。但是CWOI2018，终于却也是只有我一个人走下去了。4年了，每次考试过后，机房都会少一些人，或许已经有些习惯了，但是想起心里还是会空空的，不知道该说些什么了。既然给了我这样一个机会，或许我能做到的，就只能是在接下来的一段时间里，试着再努一把力吧。 Nobody learns without getting it won 人生亦是在坚持到胜利之后方才寻得答案 I won&apos;t give up, no I won&apos;t give in 我不会放弃 也绝不妥协投降 Till I reach the end, then I&apos;ll start again 直到到达终点 然后迈向新的战场","tags":[{"name":"OI","slug":"OI","permalink":"https://hplv.pw/tags/OI/"}]},{"title":"Polya计数法","date":"2018-03-14T07:03:56.000Z","path":"posts/polya/","text":"OI中常常遇到这样一类问题，我们需要计算本质不同的方案数量，polya便是解决这类计数问题的一种很好的方法。 概念群给定一个集合 $ G = {a,b,c,…} $ 和集合 $ G $ 上的二元运算 $ * $ ，并满足封闭性，结合律，对每个存在单位元和逆元。 置换$n$ 个元素，每个元素被 $1 - n$ 中的某个元素取代，这些元素互不相同，称作一个置换。比如 $(1, 2, 3, 4) = (2, 3, 1, 4)$ 就是一个置换。 置换群所有满足条件的置换构成的集合称做一个群，可以证明这个集合满足群的所有条件。 Burnside定理Burnside定理是Polya的基础。用 $D(a_j)$ 表示在置换 $a_j$ 下不变的元素的个数。$L$ 表示本质不同的方案数。$$ L = \\frac{1}{|G|}\\sum_{j = 1}^{s}D(a_j) $$ Polya计数法对于Burnside定理，一般情况下置换群 $|s|$ 是相当大的值，多数情况下是 $np$ 级别。 循环$(a_1, a_2…a_n) = (a_n, a_1…a_{n - 1})$ 是一个 $n$ 阶循环，可以直接表示为 $(a_1, a_2…a_n)$。可以发现，每个置换都是由一个或多个循环组成的。 推导易知，对于一个循环置换不变的子集，所有元素的染色必然相同，当有m种颜色时，对于循环节个数为c(g)的置换g有 $m ^ c(g)$ 中方案。 公式$$ L = \\frac{1}{|G|}\\sum_{i = 1}^{|s|}m ^ {c(g_i)} $$ 应用Transportation is funSPOJ TRANSP2 题意把一个矩阵变为它的转置，每次可以交换两个元素，求最小操作次数。 题解一个位置用二进制坐标 $(i, j)_2$ 表示，转置之后变为 $(j, i)_2$ 。可以发现，当把 $i$ 看作 $a$ 位的二进制数， $j$ 看作 $b$ 位的二进制数， $ij$ 连接在一起看作一个 $a+b$ 位的二进制数，转置就可以理解为一个二进制数循环移动了 $b$ 位。原题转化为，对于 $[0,2^{a + b})$ ，每次交换两个数，求把原位置上的数变成循环移动 $b$ 位的数需要多少次操作。很容易想到，每次直接把原数交换到对应的位置上，在从交换过来的位置上继续交换，直到循环回到原位置，这样操作是最优的。操作次数为循环的长度减一，设循环节有 $d$ 个，则一共需要交换 $2 ^ {a + b} - d$ 次。容易发现，每个循环节内，地址对于循环移动 $b, 2b, 3b…$ 是本质相同的，问题转化为对于b的倍数的循环移动本质相同的地址个数。易得循环节长度为 $lcm(b, a + b) / b$ ，循环节个数为 $gcd(b, a + b)$ 。把这 $gcd(b, a + b)$ 个循环节绑在一起，问题转化为对有 $lcm(b, a + b) / b$ 个点的环，每个点的数范围为 $[0, 2 ^ {gcd(b, a + b)}) $, 在旋转的情况下本质相同的方案数。 Sgu282 IsomorphismBZOJ1478 题意用 M 种颜色对 N 个结点的无向完全图边染色。若两个已染色的图，其中一个图可以通过结点重新编号而与另一个图完全相同，就称这两个染色方案相同。问有多少种本质不同的染色方法。 题解边肯定是没法拿来枚举的，我们可以枚举点的置换来看对边有什么影响。但是 N = 53 ，复杂度肯定吃不消，所以我们需要换一种枚举方式，可以发现，其实点的顺序并不影响统计答案，所以我们只需要枚举每一种循环节长度的组合并且计算这个组合对应的点置换个数。对于每种组合 $n=c_1n_1+c_2n_2+…+c_kn_k$（ $c_i$ 表示元素数量为 $n_i$ 的环的个数）, $n$ 个节点的全排列有 $n!$ 种方案，其中每个环 $i$ 被重复计算了 $n_i!$ 次，固定一个点剩下的点有 $(ni-1)!$ 种排列情况，重复计算了 $n_i$ 次，也可以参考圆排列来理解这里。对于元素数量相同的环，重复计算了 $c_i!$ 次，所以这种组合对应的置换群个数为 $\\cfrac{n!}{n_1^{c_1}n_2^{c_2}…n_k^{c_k}c1!c2!…ck!}$ 。有了枚举点置换的方法，我们可以来考虑点置换与边置换的关系。对于一个循环节内部的点，一共有 $\\lfloor\\frac{n}{2}\\rfloor$ 个边循环节。对于两个循环节之间的点，设循环节大小分别为 $a, b$ ，一共有 $gcd(a, b)$ 个边循环节。综合以上，可以得到答案。","tags":[{"name":"OI","slug":"OI","permalink":"https://hplv.pw/tags/OI/"},{"name":"math","slug":"math","permalink":"https://hplv.pw/tags/math/"},{"name":"polya","slug":"polya","permalink":"https://hplv.pw/tags/polya/"}]},{"title":"Hello World","date":"2018-03-05T11:58:30.295Z","path":"posts/hello-world/","text":"博客迁移到 hexo 。 服务器同时部署到github与coding.io 图床使用微博，qcloud，qiniu 主题使用indigo 评论使用valine 统计使用不蒜子 看板娘使用插件hexo-helper-live2d模型live2d-widget-model-ni-j","tags":[]}]